{
    "title": "Stackbit Starter Theme",
    "path_prefix": "/",
    "header": {
        "title": "Kaufman and Associates",
        "has_nav": true,
        "nav_links": [
            {
                "label": "Legal Services",
                "url": "/features",
                "style": "link"
            },
            {
                "label": "Legal Resources",
                "url": "/blog",
                "style": "link"
            },
            {
                "label": "About",
                "url": "/about",
                "style": "link"
            },
            {
                "label": "Contact Us",
                "url": "/contact",
                "style": "primary"
            }
        ]
    },
    "footer": {
        "has_nav": true,
        "nav_links": [
            {
                "label": "Contact Us",
                "url": "/contact",
                "style": "link"
            },
            {
                "label": "Privacy and Terms",
                "url": "/terms",
                "style": "link"
            }
        ],
        "has_social": true,
        "social_links": [
            {
                "label": "Twitter",
                "url": "https://twitter.com/",
                "style": "link",
                "new_window": true
            },
            {
                "label": "GitHub",
                "url": "https://github.com/",
                "style": "link",
                "new_window": true
            },
            {
                "label": "LinkedIn",
                "url": "https://www.linkedin.com/",
                "style": "link",
                "new_window": true
            }
        ],
        "content": "(312) 993-0030 Kaufman and Associates Chicago Real Estate Lawyer, Foreclosure Defense and Eviction ExpertHOMEABOUT USLEGAL SERVICESLEGAL RESOURCESCONTACT US REAL ESTATE LEGAL RESOURCES FORECLOSURE DEFENSE LEGAL RESOURCES EVICTION LEGAL RESOURCES Chicago Lawyer Real Estate Lawyer, Foreclosure Defense and Eviction Expert Kaufman and Associates is a father son law firm, and the firm of choice for any and all legal advice and representation in the Chicagoland Area. Specializing in Real Estate Transactions, Evictions, Civil Law, Real Estate Disputes, and Business Law, our skilled and competent Chicago lawyers have years of experience representing individual clients and corporations.  Kaufman and Associate's services go way beyond court trials and out of court settlements, however. Our skilled attorneys make it a point to support their clients from the very beginning all the way to the very end, offering counsel, advice, and studying each and every case closely to ensure every detail of the case is taken into account and used to their client's benefit. We also provide follow-up services in cases where paper work or applications must be filled.  Testimonials ⭐⭐⭐⭐⭐ Nilka Cintron Thank you Attorney Kaufman for your help with my clients closing. My client was very happy with how you were able to solve his problem and close his sale in a week. I had this file for almost a year. I had 4 attorneys review the file and told my client had to go before a judge to prove he owned the property. You made two phone calls and solved the problem in two business days. We are greatful to you, your assistant Jeannette and your staff. Thank you  ⭐⭐⭐⭐⭐ Steve Braciszewicz There are several negative reviews here (including someone who wasn't even represented by Kaufman and Associates), but I wanted to share my actual previous experiences with this firm. In the past five years, we have purchased two homes and sold a home while being represented by Kaufman and Associates and everything was fantastic. Ira is honest, understanding, experienced and will fight for what's best for his client's interests. We respected his tenacity; he's' the type of attorney you want on your side of the table. Jeanette and Linda were also a pleasure to work with; they're extremely courteous and responsive to your concerns when you call the office. We recently referred a close friend who was represented by this firm with the sale and purchase of their home, who also had a positive experience. Don't listen to the complainers here - this firm does great work.  Read More Legal Expertise If you require Chicago legal advice or representation, do not hesitate to call Kaufman and Associates today. Someone is standing by to help you take your first step towards putting matters of the law behind you. We specialize in many areas of practice, below is a partial listing. If you are unsure if any of these areas of legal expertise apply to you simply give us a quick call at: (312) 993-0030  Real Estate Law Civil Law Business Law Foreclosure Defense About Us Our Approach Our firm has extended experience, this is cornerstone of our success. Each area of the law is very different and must be handled with the level of care, expertise and experience that is relevant to its specification.  Legal Resources We are Leaders in the sphere of Chicago legal services. Specializing in most any area of the law, including Real Estate Litigation, Transactional Work, Evictions and Foreclosure Defense.  Legal Team We are an experienced team of Chicago lawyers with up-to-date know how. Kaufman and Associates holds an impressive success rate. Our Chicago lawyers succeed in settling cases out of court, saving our clients much time, stress and money.  Home   |   About Us   |   Legal Services   |   Legal Resources   |   Contact Us   |   Sitemap  We Accept:Visa MasterCard Discover Amex Cash Check Debit PayPal"
    },
    "domain": "https://super-moon-fff8d.netlify.app"
}